; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v4 - type_3 ?v5 - type_2)
 	      (pred_2 ?v1 - object ?v5 - type_2)
	      (pred_4 ?v4 - type_3 ?v3 - type_1)
	      (pred_1 ?v4 - type_3 ?v1 - object ?v3 - type_1))

   (:action op_3
       :parameters  (?v4 - type_3 ?v8 ?v6 - type_2)
       :precondition (and  (pred_3 ?v4 ?v8))
       :effect (and  (pred_3 ?v4 ?v6)
		     (not (pred_3 ?v4 ?v8))))

   (:action op_1
       :parameters (?v4 - type_3 ?v2 - object ?v7 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_2 ?v2 ?v7) (pred_3 ?v4 ?v7) (pred_4 ?v4 ?v3))
       :effect (and (pred_1 ?v4 ?v2 ?v3)
		    (not (pred_2 ?v2 ?v7)) 
		    (not (pred_4 ?v4 ?v3))))

   (:action op_2
       :parameters (?v4 - type_3 ?v2 - object ?v7 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_1 ?v4 ?v2 ?v3) (pred_3 ?v4 ?v7))
       :effect (and (pred_2 ?v2 ?v7)
		    (pred_4 ?v4 ?v3)
		    (not (pred_1 ?v4 ?v2 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_13 obj_06 - type_3
obj_08 obj_07 obj_11 obj_02 - type_1
obj_14 obj_01 obj_09 obj_10 - type_2
obj_05 obj_12 obj_04 obj_03 - object)
(:init
(pred_3 obj_13 obj_10)
(pred_4 obj_13 obj_08)
(pred_4 obj_13 obj_07)
(pred_3 obj_06 obj_09)
(pred_4 obj_06 obj_11)
(pred_4 obj_06 obj_02)
(pred_2 obj_05 obj_01)
(pred_2 obj_12 obj_10)
(pred_2 obj_04 obj_01)
(pred_2 obj_03 obj_01)
)
(:goal
(and
(pred_2 obj_05 obj_14)
(pred_2 obj_12 obj_10)
(pred_2 obj_04 obj_09)
(pred_2 obj_03 obj_09)
)
)

(:constraints
  (always (not (pred_3 obj_13 obj_09)))
)
)

; plan
1. (op_3 obj_13 obj_10 obj_01)
   deleted: (pred_3 obj_13 obj_10)
   added: (pred_3 obj_13 obj_01)
   goals met: 1 of 4
2. (op_3 obj_06 obj_09 obj_01)
   deleted: (pred_3 obj_06 obj_09)
   added: (pred_3 obj_06 obj_01)
   goals met: 1 of 4
3. (op_1 obj_13 obj_05 obj_01 obj_07)
   deleted: (pred_2 obj_05 obj_01) (pred_4 obj_13 obj_07)
   added: (pred_1 obj_13 obj_05 obj_07)
   goals met: 1 of 4
4. (op_1 obj_06 obj_03 obj_01 obj_02)
   deleted: (pred_2 obj_03 obj_01) (pred_4 obj_06 obj_02)
   added: (pred_1 obj_06 obj_03 obj_02)
   goals met: 1 of 4
5. (op_1 obj_06 obj_04 obj_01 obj_11)
   deleted: (pred_2 obj_04 obj_01) (pred_4 obj_06 obj_11)
   added: (pred_1 obj_06 obj_04 obj_11)
   goals met: 1 of 4
6. (op_3 obj_13 obj_01 obj_14)
   deleted: (pred_3 obj_13 obj_01)
   added: (pred_3 obj_13 obj_14)
   goals met: 1 of 4
7. (op_3 obj_06 obj_01 obj_09)
   deleted: (pred_3 obj_06 obj_01)
   added: (pred_3 obj_06 obj_09)
   goals met: 1 of 4
8. (op_2 obj_13 obj_05 obj_14 obj_07)
   deleted: (pred_1 obj_13 obj_05 obj_07)
   added: (pred_2 obj_05 obj_14) (pred_4 obj_13 obj_07)
   goals met: 2 of 4
9. (op_2 obj_06 obj_03 obj_09 obj_02)
   deleted: (pred_1 obj_06 obj_03 obj_02)
   added: (pred_2 obj_03 obj_09) (pred_4 obj_06 obj_02)
   goals met: 3 of 4
10. (op_2 obj_06 obj_04 obj_09 obj_11)
   deleted: (pred_1 obj_06 obj_04 obj_11)
   added: (pred_2 obj_04 obj_09) (pred_4 obj_06 obj_11)
   goals met: 4 of 4
